import numpy as np
import warnings

warnings.filterwarnings('ignore')

maxFnameLen = 10

# Веса первого слоя нейронной сети (100x11)
Theta1 = np.array([
    (0.148701, 0.46217, 0.106053, 0.0684773, 0.619353, 0.20583, 0.477247, -0.966234, -0.521831, -0.432753, -0.0327044),
    (0.321584, 0.231335, 1.17315, -1.36006, -1.7127, -0.329173, -0.0866173, 2.71866, -1.00676, -0.242274, 0.00611784),
    (0.148686, -0.493083, 0.252917, 0.361265, 0.0209918, -1.16651, 0.540243, -0.69111, 0.130027, -0.260393, -0.0884928),
    (-0.12235, -0.393616, 0.187417, -0.652634, -0.774152, 0.550529, 0.301136, -0.468119, -0.496528, -0.28134, -0.00021621),
    (0.313843, -1.2197, 0.700588, -0.410287, -0.193755, -0.000353838, -0.34032, 0.355275, 0.666477, 0.154059, 0.0734692),
    (-0.242027, -0.700458, 0.154036, 0.658452, -1.932, 1.02687, -0.0589738, 1.1454, -0.638081, -0.0235056, 0.351988),
    (0.521859, 0.399209, 1.11606, -0.710577, -0.473409, 0.470684, 0.124716, -0.966981, -0.194269, 0.408602, 0.0492724),
    (0.211528, -1.67159, 1.54189, 0.768701, 1.16227, -0.172581, 0.302861, -0.964995, 1.66612, -0.300933, 0.108959),
    (-1.66298, -0.0267856, 0.0107912, -0.0197008, 0.0798777, 0.0223088, 3.83871, 0.549848, -1.08406, 0.349308, 0.00428),
    (-0.34199, -0.794602, -1.08733, 0.858684, 1.34219, 0.876336, 0.11864, -0.803302, 1.00111, 0.104443, -0.0208214),
    (0.0634363, -0.599623, 0.777573, 0.303626, 1.1635, 0.552013, -0.468959, -0.83886, -0.0695482, 0.224563, 0.043406),
    (0.303022, -0.000209634, 0.572842, 0.109516, -1.19224, -1.17425, 0.915886, 1.59035, 0.631815, -0.0406161, -0.0761802),
    (0.183394, 0.483441, -0.338406, 0.940471, -0.199022, 0.490741, 0.727374, -0.0984554, -0.560095, -0.260157, -0.040721),
    (-0.248164, 0.0356162, 0.361789, -2.13475, 0.568962, -1.18728, -0.403542, 0.526547, -1.01912, 0.144715, -0.120643),
    (0.184464, -1.03811, -0.0104087, -0.295683, -0.479038, -0.43233, 1.0134, -0.0152699, 0.295799, -0.556014, -0.214429),
    (-0.365693, -0.370909, -1.0344, -0.360217, 0.482831, 1.91878, 0.749709, 0.715773, 0.115583, 0.0252511, -0.00547466),
    (-0.0905129, 0.64596, 0.276929, 0.618903, 0.266075, -0.33359, -1.72612, -0.970129, 0.407938, 0.677219, 0.0272557),
    (0.0222425, -0.253404, 1.18292, 0.398455, -0.593953, -0.765985, -0.885662, 1.92458, 0.12038, 0.0832104, -0.0270007),
    (0.104707, 1.0972, -0.262155, 0.497449, -2.2799, -0.251577, -0.486039, -0.426589, 0.0772179, 0.333454, 0.27715),
    (0.0850448, 0.448376, -0.672357, -0.227824, 1.352, 0.594095, -0.0657429, 1.21525, -0.0253531, -0.783646, -0.175385),
    (0.433826, 1.14872, 0.347325, -0.18828, 0.151136, -1.79208, 0.474999, -0.258293, -0.00705866, -0.0297328, 0.0612579),
    (0.472487, -0.776485, 1.2172, 0.93337, 0.509903, -0.0486995, -1.43514, 0.492165, -0.258832, -0.428182, -0.262904),
    (-0.583976, 0.0590916, 0.0109984, 0.0165265, 0.0281247, 0.0412706, -0.12172, 2.76167, -3.31224, -1.22963, -0.223565),
    (0.53805, 0.416191, 0.627823, 1.18854, 0.0631814, -0.997998, -0.504501, -0.669573, -0.67777, -0.972407, 0.017643),
    (-0.0922183, -0.191223, -0.051811, 0.376834, 0.211766, 0.405342, -0.282534, 0.0922085, -0.261866, -0.0581745, -0.0574146),
    (0.129229, -0.0118778, -1.92559, 0.0301095, 2.35079, 0.889699, -1.42105, -0.644804, -1.07695, -0.342919, -0.273975),
    (-0.274507, 0.746973, 0.22412, 1.0357, -0.0259937, -0.769653, 0.542603, -0.322475, 0.521669, 0.135819, 0.0429645),
    (0.640083, -0.809397, -0.429181, -0.654977, -0.485277, 1.62637, 1.10422, -0.87783, 0.757664, 0.578707, 0.0534911),
    (0.589097, -0.719022, -0.720748, -0.118867, 0.282285, -0.080846, 0.182875, -1.36517, -0.0882717, 0.648482, -0.130223),
    (-0.0460202, 1.20508, 0.29915, -0.0684891, -1.79956, -0.674445, 0.625276, -0.208356, 0.328856, -0.133614, -0.149182),
    (0.0430913, -0.188785, 0.118719, -0.470091, -0.262132, -0.26131, -0.0884023, 0.370028, 0.168674, -0.0454885, 0.0763963),
    (-0.000426265, -1.64924, 0.0525325, 0.454681, -0.137455, -0.546769, 0.308286, -0.0634356, -0.673728, 0.134948, 0.039459),
    (0.108304, -0.898408, 1.43438, -1.97067, 0.966388, 0.639596, -0.866084, 1.01764, -0.540882, -0.121876, 0.0317943),
    (0.0366125, -0.164835, 0.00912658, 0.293402, 0.114809, 0.29804, 0.152385, -0.0408868, 0.0806669, -0.104819, 0.0493094),
    (0.443203, -0.940936, 2.14725, -0.0405626, 0.570194, -2.70843, 0.647889, -0.27869, -1.44364, -0.183884, 0.00381867),
    (0.411326, 0.0810977, 1.84951, 0.209674, -1.36505, -0.00334208, 0.254754, 0.21138, -0.548003, 0.471041, 0.158264),
    (0.0415147, 0.732447, 0.0273031, -1.0913, -0.0384104, -1.54392, 0.261004, -0.479348, 0.0118923, 0.813171, -0.0979317),
    (0.453474, -0.637037, -0.871312, -0.462197, 0.309257, -0.082963, 0.366613, 1.41243, -0.445793, 0.235806, 0.0880425),
    (-0.259318, 0.309325, -0.00692364, -0.805758, 1.66044, 0.817657, 1.02053, -1.55731, -1.6062, -0.903389, 0.173526),
    (0.117283, -1.75246, 0.386992, -1.13069, 0.519141, 0.789233, -1.16382, -0.0994398, 0.24142, -0.517998, 0.0465671),
    (-0.708221, -1.03621, 0.693702, -0.755586, 1.02613, 1.66402, -1.20259, 0.17506, 1.02245, 0.794184, 0.237608),
    (0.143734, 0.133168, 0.211663, 0.315693, 1.55903, -0.633865, -0.26172, -1.90689, -0.0994247, -0.462717, 0.00330434),
    (-1.0848, -0.183513, -0.808239, -0.195833, 0.829226, -2.54048, 3.26763, -0.343798, -1.55822, 0.65067, 1.02355),
    (-1.69609, 0.0252804, -0.072094, -0.113378, -0.0103812, 0.36734, -2.26672, 2.91474, -1.74346, -0.603623, 0.0221515),
    (-0.147664, -0.888194, -1.24729, 0.745759, 1.05828, 0.354192, 0.893744, 1.10523, 0.00236935, 0.0576013, -0.0729845),
    (-0.0994648, -0.21743, 0.055031, 0.736159, 0.645389, 0.680488, 0.291777, -1.08357, -0.41077, -0.0668676, -0.0151143),
    (-0.189342, -0.629116, -0.863728, 0.296746, -0.397237, 0.972531, -0.868412, -1.96127, 0.716142, -0.125689, 0.167152),
    (-0.323882, -1.32173, 0.622388, -1.23752, -1.07242, 1.92276, 0.564974, 0.0413906, -0.283014, -0.53, -0.099158),
    (-0.102183, -0.0860342, -0.0529853, 0.751479, -0.639435, 0.645294, 0.338303, -0.153682, -0.203919, 0.112677, -0.0204072),
    (-0.82798, 0.126489, -0.154342, -0.657831, 0.00135019, 1.38211, -0.606894, -1.17509, 1.17535, 0.0306691, 0.175489),
    (-0.222608, -0.0313778, 0.00994631, 0.0555474, -0.0958265, 3.4179, -3.13998, -1.90482, 1.04028, 0.22426, -0.428111),
    (0.162047, 0.263492, 1.27518, -1.14577, -0.117716, -2.56511, 0.900921, -0.911238, 0.528707, -0.992149, 0.0978571),
    (-0.389626, -0.0910204, -0.156176, 1.60527, 0.645685, -0.289612, -1.4448, -0.909375, 0.0624196, -0.578007, -0.0204188),
    (-0.368809, -0.314846, -0.416547, -0.586695, 1.61348, -1.8628, 0.614799, -0.590322, 0.00433738, -0.288076, -0.071972),
    (0.390853, -2.02259, 0.7407, -1.05075, 1.07705, 0.0249663, -0.697621, 1.34753, 1.40904, 0.129335, -0.0198816),
    (0.136061, 0.223661, -0.167842, 0.487394, -0.25831, -0.519131, 0.285516, -0.235444, 0.0987343, 0.133462, 0.0994565),
    (-0.488785, -0.753749, 0.190525, 1.61331, -0.240905, -1.7655, 0.921329, -0.264244, -0.0571902, 0.720604, 0.107911),
    (0.134624, -1.52661, 0.442998, -0.211632, -0.386087, -0.784697, 0.7506, 0.455493, 0.0854718, -0.432489, -0.30309),
    (0.160406, 0.444306, 0.89753, 0.98725, -1.02005, -1.72295, 0.414089, -0.476776, 0.0799905, -0.0631131, -0.125213),
    (0.315766, 0.111211, 3.60281, 0.49739, -0.802285, -1.76159, 0.350523, -1.25772, 0.0579489, 0.680864, 0.635705),
    (0.368305, 0.268093, -0.955676, -0.763558, 0.691751, 0.545835, 1.05918, 0.758924, -0.31328, 0.74648, 0.0635874),
    (-0.93466, 0.184221, 1.16017, 0.679219, -0.488008, -0.575789, 1.09647, -1.28454, 2.60136, 0.54302, -0.0518397),
    (0.349546, -0.992659, -0.0748893, -0.552474, 1.15789, 0.162304, -1.34177, 2.22585, -0.132877, 0.700693, 0.108388),
    (-0.175852, -0.306977, 1.18721, 0.293864, 0.424533, -0.903285, -0.636229, 1.77017, 0.276077, 0.03252, 0.0328085),
    (-0.121872, -0.128142, 0.0149472, 0.587083, 0.569503, 0.4595, 0.083966, 0.0113682, 0.0613189, -0.00120711, -0.0517921),
    (-0.272451, 0.216442, -0.00414483, 0.0620267, 0.0584765, 0.0513792, 0.49506, 0.0987584, 0.0437328, -0.0274083, 0.104436),
    (0.0202126, 2.54305, -1.131, -0.424501, -0.10735, 0.734517, 0.725657, 0.142622, -0.10031, -0.0684729, -0.0303723),
    (-0.113379, 0.409813, 0.176127, -0.00957548, 0.434386, -0.168815, -0.261687, -0.20703, 0.052619, -0.08731, 0.00402957),
    (0.430724, -0.259148, -0.344811, 0.361844, -1.46663, 1.61082, 0.0318573, 1.39907, 0.770041, -0.213169, -0.111561),
    (0.141112, -2.0258, -0.0499306, 0.757457, 0.788308, 0.694167, -0.59694, -0.277255, -0.0519782, 0.215878, -0.11424),
    (-0.166348, 0.106468, 0.0342644, -0.10998, 2.34952, -0.195269, -0.330324, -0.175253, -0.361693, -0.364232, -0.135337),
    (-0.217892, -0.179084, 0.165412, -0.506357, 0.0498272, 1.09005, -1.48177, -1.48157, 0.129444, 0.184673, 0.056208),
    (-0.335209, -0.329745, 0.272872, -0.413477, 0.690859, -0.416035, 0.612484, -1.26546, 1.19365, -0.0430246, 0.0356788),
    (-0.0156283, 0.172924, 0.0142307, 0.0454928, 0.138262, 0.0149343, 0.0247674, 0.121897, 0.0579354, 0.0703737, 0.0855242),
    (0.0138784, 1.14577, 1.07258, 0.383983, -1.66502, -0.12196, -0.0581319, -1.03351, -0.427516, -0.123495, 0.0613005),
    (0.0949229, -1.52865, 0.370206, 0.94714, 1.2095, 1.86614, -1.1573, -0.0162997, -0.0740653, 1.02831, 0.0823268),
    (0.722019, 1.11781, -0.666458, 0.649961, -2.07705, -0.55241, 1.03862, -0.0740449, -0.953369, -0.612934, -0.347246),
    (0.0147833, -0.126646, 0.0255379, 0.504686, 0.357016, 0.116279, -0.0131316, 0.117018, -0.0085027, 0.0346886, 0.0948916),
    (-0.206419, -0.270621, -0.289148, -0.277582, -0.942474, 0.101253, 2.24612, 1.09996, -0.545531, -0.183869, 0.0593283),
    (0.046323, 0.922969, 0.544366, 0.178248, -1.43843, -1.25771, 1.20001, -0.197902, -0.138647, -0.0990485, 0.346682),
    (-0.450014, 0.821722, -0.940477, -0.129945, 0.351413, -1.50165, 0.67597, 0.441923, 0.0673167, -0.243019, -0.221074),
    (-0.041877, 0.223996, -0.139874, 0.528846, 0.225524, 0.382609, 0.0311683, -0.126571, -0.414572, -0.0414915, 0.0277127),
    (-0.120146, 0.559573, -1.3981, 0.0782564, 1.76313, -1.89519, 0.0839933, 1.29888, -1.10023, -0.557709, -0.0293238),
    (-0.0516818, -0.675371, -0.287246, -0.749188, -0.218177, -0.554446, 1.72709, 1.01925, 0.0222897, -0.703605, -0.290718),
    (0.192658, 1.02408, 0.317788, -1.32274, 1.52012, 0.620169, 1.4037, 0.368233, 0.255917, 0.0494447, 0.0768596),
    (-0.471242, 1.11926, -1.50166, 0.682447, 0.0399531, 0.54053, -1.53505, -0.229335, 0.333933, 0.282946, -0.0530009),
    (-0.0317306, 0.260275, 0.167128, 0.338182, -0.625732, 0.628152, 0.304767, -0.680236, 0.25568, -0.0015253, -0.0689147),
    (0.235383, -0.227148, 0.0235479, -0.0474634, -0.302088, 0.0225443, -0.405198, -0.0398452, 0.0320316, -0.07522, -0.0905894),
    (0.0102082, -1.98592, -0.831027, 1.15998, 0.0876453, 1.49203, -0.0335857, -0.508662, -1.90636, -0.203468, -0.338076),
    (0.00146718, 0.612374, 0.376316, 0.166129, -0.763718, 1.24184, -1.01449, -0.0328418, -0.195012, 0.53193, 0.0844639),
    (0.18671, -0.991757, 0.257671, -0.547196, 1.20491, -0.379932, 0.442692, 0.341676, 0.677702, 0.12948, -0.0750324),
    (0.85335, -0.643068, -0.638506, -0.157612, 1.76415, -0.167717, -0.668947, -1.59957, 1.05889, 0.0517159, 0.229033),
    (0.110122, 0.974015, 0.301793, 1.08627, -0.962778, 1.16576, -1.58091, 1.23458, 0.887956, -0.649375, 0.0284426),
    (-0.418069, 0.442847, 1.9318, -0.226852, 0.444292, -0.752479, -0.531419, 1.34322, -2.0493, -0.532424, -0.0322354),
    (0.244863, 0.147894, -0.0112678, -0.899607, 0.081569, 2.21791, 1.49256, -2.57105, 1.30518, -0.532127, 0.195908),
    (0.0483335, -0.178983, 1.48341, -0.668133, -0.137048, -1.09002, 0.308615, 0.272578, 0.909288, 0.0335296, 0.255214),
    (0.0751533, -0.11544, 0.0746156, -0.105564, -0.152465, -0.111338, 0.127954, -0.0493671, -0.0599333, 0.0475536, 0.0618134),
    (0.137965, -0.26092, -1.54156, 0.163705, 0.45097, 1.70729, -1.02327, 0.405591, 0.143435, 0.277625, -0.148693),
    (0.14111, 0.632811, 1.83266, 0.0588428, -0.634385, -1.54641, -0.585958, 0.329717, -0.862969, -0.491766, 0.00568949),
    (0.797407, 0.823297, 0.0982863, -1.49231, -0.895851, 1.11645, -0.257716, 1.79152, -0.353211, -0.0682331, -0.200116)
])

# Веса второго слоя нейронной сети (2x101)
Theta2 = np.array([
    [
        -0.169404, -0.958652, -3.23371, 1.26471, 1.15678, -1.31086, 1.99928, -1.87365, 2.35941, 3.32103,
        1.77907, -1.73599, 2.10844, -1.21467, -2.30239, 1.05734, -1.89232, 1.74375, -1.71856, -2.45785,
        1.80596, 1.73007, 1.63961, 3.60241, -2.35402, 0.562903, 2.34379, 1.17001, 2.23656, -1.55475,
        1.91094, 0.399529, -1.50792, 2.12845, 0.352093, 2.71762, -2.23367, -2.6615, -1.85774, -3.08003,
        -1.90502, -1.63002, -2.09862, -3.41951, -3.63913, -1.80539, -1.56136, -1.95182, -2.03695, -1.08705,
        -2.36907, 2.8893, 2.71254, -1.97641, -1.87725, 2.70971, -0.993802, -2.49052, 1.42832, 3.27819,
        -2.54527, 1.60086, 2.51723, -2.37115, -1.58351, -0.641268, 0.578787, -2.38394, 0.552911, -1.96924,
        1.41874, 1.64202, 1.80371, -1.64546, 0.317465, -1.46447, -2.49245, 2.49065, -0.450664, -2.38624,
        -2.26964, 2.18852, -0.469395, -2.7988, 2.44577, 2.28831, 1.32605, -0.987121, -0.43917, 2.04175,
        -1.78071, 1.05191, -2.04179, 2.08071, 2.2232, 2.58218, -1.14474, -0.121297, 1.82643, 2.56498, 2.03471
    ],
    [
        0.0918143, 0.969531, 3.23632, -1.28293, -1.16227, 1.3017, -1.99041, 1.87223, -2.36934, -3.32708,
        -1.77408, 1.76182, -2.10349, 1.18863, 2.28727, -1.06227, 1.88851, -1.74446, 1.71949, 2.45748,
        -1.74581, -1.73067, -1.64044, -3.60975, 2.36035, -0.595553, -2.34326, -1.22336, -2.23982, 1.55873,
        -1.92354, -0.355154, 1.51877, -2.13245, -0.342969, -2.70924, 2.22405, 2.64028, 1.85565, 3.07622,
        1.88236, 1.61991, 2.11212, 3.41758, 3.62959, 1.80445, 1.55499, 1.93474, 2.02984, 1.09552,
        2.36814, -2.8946, -2.71216, 1.98489, 1.87302, -2.71653, 0.959635, 2.48471, -1.4481, -3.27926,
        2.53539, -1.60021, -2.50894, 2.38445, 1.59002, 0.740711, -0.47458, 2.37551, -0.523529, 1.96879,
        -1.42151, -1.6773, -1.80454, 1.65212, -0.220344, 1.46387, 2.48785, -2.48606, 0.355038, 2.38301,
        2.26466, -2.19426, 0.445685, 2.79633, -2.44131, -2.2909, -1.32658, 0.98789, 0.584923, -2.03618,
        1.77325, -1.0666, 2.03598, -2.07619, -2.22489, -2.59546, 1.14914, 0.209862, -1.83162, -2.57302, -2.04638
    ]
])


def sigmoid(z):
    return 1 / (1 + np.exp(-z))


def formatName(fname):
    return '{0: <{l}}'.format(fname[:], l=maxFnameLen)[0:maxFnameLen].upper()


def formInput(fname):
    formatted_name = formatName(fname)
    res = [1]
    for char in formatted_name:
        val = 1 + ord(char) - ord('A')
        if val < 0:
            val = 0
        res.append(val)
    return np.matrix(res)


def predict(fname):
    try:
        inp = formInput(fname)
        h1 = sigmoid(inp * Theta1.T)
        h1_biased = np.c_[np.ones(1), h1]
        h2 = sigmoid(h1_biased * Theta2.T)
        
        diff = h2[0, 0] - h2[0, 1]
        
        if diff > 0.1:
            return 'Girl'
        if diff > 0.05:
            return 'probably a Girl'
        if diff < -0.1:
            return 'Boy'
        if diff < -0.05:
            return 'probably a Boy'
            
        return 'hard to guess'
    except Exception:
        return 'hard to guess'


def GetGender(name):
    def get_gender_rus(name):
        male_names = {'аади', 'абад', 'абай', 'абан', 'абд', 'абдул', 'абдула', 'абдулла', 'абдурахман', 'абердин', 'абзал', 'абиджан', 'абик', 'абу', 'абылай', 'авангард', 'август', 'аверин', 'авив', 'авто', 'аго', 'агу', 'адам', 'аддис', 'аддисон', 'аден', 'адил', 'адилет', 'адлер', 'адм', 'адольф', 'адриан', 'азамат', 'азат', 'азер', 'азизбек', 'азим', 'азимут', 'азот', 'айбек', 'айдар', 'айдин', 'айдос', 'айдын', 'айк', 'айленд', 'айни', 'айрапетян', 'айрат', 'айсен', 'ака', 'акад', 'акакий', 'акбар', 'аким', 'акмал', 'акса', 'аксай', 'актаныш', 'акташ', 'акъяр', 'акылбек', 'алам', 'алан', 'албай', 'алвар', 'алдан', 'алдияр', 'алек', 'алекс', 'александ', 'александер', 'александор', 'александр', 'александро', 'алексей', 'алеку', 'ален', 'алеппо', 'алеф', 'алешка', 'али', 'алибек', 'алии', 'алик', 'алим', 'алихан', 'алишер', 'аллах', 'аллен', 'алмат', 'алпамыс', 'алтай', 'алти', 'алтынбек', 'алые', 'аль', 'альберт', 'альп', 'альтаир', 'альфред', 'альянс', 'алёша', 'алёшка', 'амангельды', 'аманжол', 'амелин', 'амес', 'амин', 'амир', 'амирхан', 'амо', 'аму', 'амур', 'анар', 'анатолий', 'анвар', 'андерсон', 'анджело', 'андраник', 'андреи', 'андрей', 'андрес', 'андрий', 'андрюха', 'андрюша', 'андрюшка', 'анзор', 'аниме', 'ано', 'анти', 'антипин', 'антон', 'антонио', 'антоша', 'антошка', 'ануар', 'анх', 'апельсин', 'аппе', 'апу', 'арад', 'арам', 'арарат', 'арби', 'аргун', 'ардон', 'аренда', 'арий', 'аристарх', 'ариф', 'аркадий', 'армавир', 'арман', 'армен', 'арнольд', 'арсен', 'арсений', 'арслан', 'арт', 'артак', 'артем', 'артемий', 'артемка', 'арти', 'артик', 'артур', 'артём', 'артёмка', 'арутюнян', 'арчи', 'асак', 'асан', 'асанов', 'асир', 'аск', 'аскар', 'аскер', 'аслан', 'асо', 'асу', 'асхат', 'асылбек', 'асылжан', 'ата', 'атлант', 'атлантик', 'ато', 'афанасий', 'ахмад', 'ахмед', 'ахмет', 'ачи', 'ашот', 'бабак', 'бабич', 'баган', 'багдат', 'баглан', 'бад', 'баден', 'базе', 'баир', 'байконур', 'бак', 'бакай', 'баки', 'бакыт', 'бакытжан', 'бала', 'балабан', 'балан', 'балта', 'банда', 'баран', 'бари', 'барон', 'барр', 'барс', 'барыш', 'бас', 'батлер', 'батон', 'бату', 'батыр', 'баур', 'бауржан', 'бауыржан', 'баха', 'бахром', 'бахтияр', 'бахтиёр', 'бахыт', 'бахытжан', 'бач', 'бей', 'бек', 'бекболат', 'бекзат', 'бекзод', 'бексултан', 'бел', 'белан', 'белик', 'белоус', 'белтон', 'бельмонт', 'бен', 'бенд', 'бендер', 'бени', 'берг', 'берген', 'берик', 'берислав', 'берк', 'беркли', 'беркут', 'берлин', 'берн', 'бернаби', 'бернардо', 'берни', 'бертон', 'беслан', 'бессмертный', 'бест', 'бехруз', 'бибик', 'бик', 'билан', 'биллингс', 'бир', 'бирюч', 'бисмарк', 'бич', 'бичура', 'бишоп', 'блу', 'блэк', 'боб', 'богатырь', 'богдан', 'богуслав', 'богуш', 'божко', 'бой', 'бойс', 'болат', 'болдуин', 'боливар', 'бон', 'бонд', 'бонн', 'борец', 'борис', 'борислав', 'борщ', 'боря', 'бот', 'боу', 'боуи', 'бохан', 'браво', 'брага', 'брайтон', 'брандон', 'бранч', 'брат', 'браун', 'брод', 'броктон', 'бруно', 'буг', 'буда', 'буй', 'бук', 'булат', 'булах', 'булган', 'бун', 'бурак', 'бург', 'бурда', 'бурж', 'бут', 'бутко', 'буян', 'бэй', 'бэр', 'бёрни', 'бёртон', 'вагнер', 'вадик', 'вадим', 'вайс', 'валдай', 'валентин', 'валера', 'валерий', 'валик', 'вальтер', 'вано', 'ванька', 'ваня', 'ванёк', 'вар', 'варгас', 'вардан', 'вас', 'васек', 'васи', 'василий', 'василь', 'васко', 'васька', 'вася', 'васёк', 'ват', 'вашингтон', 'вегас', 'вектор', 'величко', 'велли', 'веллингтон', 'вениамин', 'верди', 'вернер', 'вернон', 'веселый', 'вечер', 'вик', 'виктор', 'вилл', 'виндзор', 'винсент', 'вис', 'вит', 'виталий', 'виталик', 'виталя', 'витек', 'витин', 'витя', 'витязь', 'витёк', 'влад', 'владик', 'владимер', 'владимир', 'владислав', 'владлен', 'влас', 'вова', 'вован', 'вовик', 'вовк', 'вовка', 'вовчик', 'воин', 'вок', 'волк', 'володимир', 'володя', 'волос', 'вольф', 'вон', 'воробей', 'ворон', 'восток', 'всеволод', 'второй', 'вугар', 'вуд', 'вул', 'вульф', 'вячеслав', 'габит', 'гавриш', 'гагик', 'гаджи', 'гай', 'гайдар', 'галим', 'галым', 'галымжан', 'гам', 'гамаюн', 'гамильтон', 'ган', 'гани', 'гари', 'гарик', 'гарри', 'гасан', 'гвент', 'геворг', 'гелиос', 'ген', 'гена', 'генадий', 'гений', 'геннадий', 'генрих', 'георги', 'георгий', 'герман', 'герой', 'герц', 'гига', 'гигант', 'гид', 'гилберт', 'глеб', 'глен', 'глостер', 'глушко', 'гога', 'года', 'голик', 'голова', 'голуб', 'гонсалес', 'гор', 'гора', 'гордей', 'горин', 'гоша', 'гран', 'гранд', 'гранит', 'грант', 'гриб', 'григор', 'григорий', 'грин', 'гринвуд', 'гриша', 'губа', 'гура', 'гус', 'гусейн', 'гут', 'давид', 'даврон', 'дагестан', 'дакар', 'далер', 'даллас', 'дальтон', 'дамаск', 'дамир', 'дан', 'даниил', 'даник', 'данил', 'данила', 'данило', 'данис', 'данияр', 'данька', 'дар', 'дарвин', 'дархан', 'дарын', 'дастан', 'даулет', 'даурен', 'дей', 'дейтон', 'декатур', 'дел', 'демид', 'демон', 'демьян', 'ден', 'денвер', 'дени', 'денис', 'дениска', 'дентон', 'дерби', 'детройт', 'джабраил', 'джалал', 'джамал', 'джамби', 'джамбул', 'джаспер', 'джеймс', 'джек', 'джексон', 'дженерал', 'джерси', 'джефферсон', 'джи', 'джозеф', 'джон', 'джони', 'джонни', 'джонс', 'джонсон', 'джордан', 'джордж', 'диас', 'дидар', 'диего', 'дизель', 'дик', 'диксон', 'дилшод', 'дим', 'димас', 'димитрий', 'димка', 'димон', 'динар', 'динис', 'дино', 'дир', 'дмитрий', 'дмитро', 'добрый', 'дод', 'док', 'дом', 'доминго', 'дон', 'дорош', 'дорсет', 'доцент', 'драган', 'драгун', 'дракон', 'дробот', 'дрозд', 'дрон', 'друг', 'дуарте', 'дублин', 'дубовик', 'дуглас', 'дулат', 'думан', 'дунай', 'дункан', 'дурбан', 'дус', 'душанбе', 'дэвис', 'дэн', 'дёня', 'евген', 'евгений', 'егор', 'егорка', 'единец', 'едуард', 'елдос', 'елец', 'елисей', 'ерасыл', 'ербол', 'ерболат', 'ержан', 'еркебулан', 'еркин', 'ерлан', 'ермак', 'ермек', 'ернар', 'есик', 'ефим', 'жадан', 'жаксылык', 'жалал', 'жалгас', 'жанат', 'жангир', 'жандос', 'жанибек', 'жас', 'жаслан', 'жасур', 'жахонгир', 'жека', 'женечка', 'женис', 'женька', 'женёк', 'житомир', 'жозе', 'жора', 'жорик', 'жуан', 'зайсан', 'закир', 'зал', 'зам', 'замир', 'запад', 'заур', 'зауре', 'зафар', 'захар', 'заяц', 'златоуст', 'зорин', 'зураб', 'ибн', 'ибрагим', 'иван', 'иванов', 'иванович', 'ивис', 'иги', 'игл', 'игнат', 'игор', 'игорь', 'идальго', 'идрис', 'измаил', 'измит', 'израиль', 'изяслав', 'ика', 'или', 'илхом', 'ильгиз', 'ильдус', 'ильич', 'ильмир', 'ильназ', 'ильнар', 'ильнур', 'ильсур', 'ильфат', 'ильшат', 'илья', 'ильяс', 'илюха', 'илюша', 'имран', 'иннокентий', 'инсар', 'ион', 'иосиф', 'ипп', 'иран', 'ирвин', 'ирвинг', 'исидро', 'искандар', 'искандер', 'ислам', 'исмаил', 'ишим', 'йемен', 'йорк', 'кабул', 'кади', 'казак', 'казанова', 'казах', 'казбек', 'казы', 'каир', 'кай', 'кайзер', 'кайрат', 'калвер', 'калин', 'калита', 'камаз', 'камил', 'камиль', 'камо', 'камыш', 'кан', 'канат', 'кано', 'кант', 'кантемир', 'кар', 'карабаш', 'карагай', 'кардаш', 'карим', 'карл', 'карло', 'карлос', 'карп', 'каси', 'касим', 'каспер', 'касым', 'касьян', 'кейт', 'кент', 'кер', 'керим', 'кеша', 'киев', 'киль', 'кинг', 'кингстон', 'кип', 'кипр', 'кир', 'кирик', 'кирил', 'кирилл', 'китс', 'кларус', 'клас', 'клемент', 'клим', 'клинтон', 'клифтон', 'кловис', 'клондайк', 'князь', 'коба', 'ков', 'кола', 'колвин', 'коллинс', 'колос', 'колумбус', 'коля', 'коммунар', 'комо', 'конкорд', 'конн', 'константин', 'конь', 'кор', 'корк', 'король', 'корпус', 'корт', 'космос', 'коста', 'костя', 'кота', 'коти', 'кристиан', 'крит', 'крус', 'крут', 'крю', 'куандык', 'куат', 'куба', 'кудус', 'кузьма', 'кузя', 'кук', 'кула', 'кулик', 'кулиш', 'кунгур', 'курбан', 'курило', 'куц', 'кучма', 'кучук', 'кэмпбелл', 'кэри', 'лаврик', 'лагос', 'лазарь', 'лайк', 'лансинг', 'ларами', 'ларго', 'леандро', 'лев', 'лева', 'леви', 'левин', 'левон', 'лейтон', 'лекс', 'лен', 'ленар', 'ленин', 'леня', 'лео', 'леон', 'леонид', 'лес', 'лесик', 'лестер', 'лех', 'леха', 'леша', 'лимон', 'линар', 'линвуд', 'линк', 'линкольн', 'лион', 'лист', 'литвин', 'логан', 'ломбард', 'лонг', 'лорд', 'лот', 'лоу', 'лоуренс', 'лох', 'луи', 'луис', 'лука', 'лукас', 'лукаш', 'любим', 'любомир', 'лёв', 'лёва', 'лён', 'лёня', 'лёха', 'лёша', 'маврикий', 'магамед', 'магас', 'магнит', 'магомед', 'мадияр', 'маис', 'майер', 'майк', 'майкл', 'майне', 'майор', 'майсур', 'мак', 'макар', 'маклин', 'макс', 'максат', 'максим', 'малик', 'мамед', 'ман', 'манас', 'манила', 'мансур', 'марат', 'марий', 'марик', 'марино', 'марк', 'марко', 'маркос', 'маркс', 'маркус', 'марс', 'марсель', 'март', 'мартан', 'мартен', 'мартин', 'мартуни', 'мартын', 'марш', 'маршалл', 'марян', 'маси', 'масис', 'мат', 'матвей', 'матео', 'махмуд', 'маяк', 'мед', 'медет', 'медфорд', 'мейсон', 'мельбурн', 'мемфис', 'мена', 'ментор', 'меркурий', 'мех', 'мигель', 'мик', 'микола', 'милан', 'милано', 'милл', 'миллер', 'милтон', 'милфорд', 'минас', 'мирас', 'мири', 'мирлан', 'мировой', 'мирон', 'мирослав', 'мит', 'митя', 'митяй', 'миха', 'михаил', 'михай', 'михайло', 'михно', 'мишаня', 'мишка', 'модесто', 'мои', 'молин', 'монолит', 'монро', 'монтгомери', 'монте', 'море', 'мороз', 'морт', 'мотор', 'муз', 'музаффар', 'мук', 'мурад', 'мурат', 'мурод', 'муса', 'муслим', 'мустафа', 'мухамед', 'мухаммад', 'мухаммед', 'мухтар', 'мэн', 'мэнсфилд', 'мюррей', 'нави', 'нага', 'надир', 'назар', 'назарет', 'назим', 'наиль', 'нарек', 'нариман', 'наруто', 'натик', 'нафиг', 'наш', 'невер', 'нельсон', 'неман', 'нечай', 'нигер', 'низами', 'никитин', 'никола', 'николай', 'нит', 'нияз', 'новик', 'ной', 'нор', 'норд', 'норман', 'норт', 'нурбек', 'нурбол', 'нурболат', 'нурдаулет', 'нуржан', 'нурлан', 'нурлыбек', 'нурсултан', 'ньютон', 'огден', 'оглы', 'один', 'одо', 'одон', 'ойбек', 'океан', 'окс', 'оксфорд', 'октябрь', 'ола', 'олег', 'олежка', 'олександр', 'олексий', 'олжас', 'олив', 'олимп', 'оман', 'омар', 'омаха', 'оол', 'оран', 'орел', 'орест', 'орион', 'орландо', 'ормонд', 'орт', 'орхан', 'оскар', 'осло', 'осман', 'остап', 'остин', 'отабек', 'отар', 'оук', 'оушен', 'оуэн', 'павел', 'павлик', 'павло', 'паго', 'палестин', 'палех', 'пампа', 'пан', 'панама', 'парасат', 'парвиз', 'париж', 'парк', 'партизан', 'паско', 'пасс', 'патрик', 'пау', 'паулу', 'пауэлл', 'пашка', 'педро', 'пер', 'пересвет', 'перец', 'переяслав', 'перри', 'перт', 'петр', 'петрик', 'петро', 'петя', 'пит', 'питер', 'платон', 'пол', 'поп', 'починок', 'прескотт', 'престон', 'принс', 'принц', 'пром', 'проф', 'прохор', 'пул', 'путин', 'пух', 'пушкин', 'пётр', 'раб', 'равиль', 'равшан', 'радик', 'радион', 'радмир', 'раздан', 'разин', 'раи', 'раиль', 'раис', 'райс', 'рам', 'рамазан', 'рамзан', 'рамиз', 'рамиль', 'рамин', 'рамис', 'рамон', 'рандольф', 'рас', 'расим', 'рассвет', 'расул', 'ратмир', 'рауан', 'рауль', 'рауф', 'рафаил', 'рафаэль', 'рафик', 'рафис', 'рахат', 'рахим', 'рахман', 'рашид', 'рашит', 'ред', 'рей', 'рейне', 'ренат', 'рес', 'ризван', 'рик', 'рим', 'ринат', 'рис', 'риси', 'риф', 'рихтер', 'ричард', 'ричи', 'ричмонд', 'ришат', 'роберт', 'ровиго', 'род', 'родион', 'рой', 'рок', 'роли', 'ром', 'роман', 'ромик', 'росс', 'росси', 'ростик', 'ростислав', 'рот', 'рочестер', 'роял', 'рубен', 'руда', 'рудик', 'рудольф', 'руз', 'руп', 'рус', 'русак', 'русин', 'руслан', 'рустам', 'рустем', 'руфат', 'рушан', 'сабир', 'сабит', 'сава', 'савва', 'савелий', 'савин', 'сагайдак', 'садак', 'садик', 'саид', 'сайко', 'сайрус', 'сакен', 'сала', 'салават', 'салам', 'салвадор', 'салем', 'салим', 'сало', 'салон', 'сальвадор', 'сам', 'самат', 'самвел', 'самир', 'саммит', 'самсон', 'санжар', 'санин', 'санкт', 'сант', 'санто', 'сантос', 'сантьяго', 'санчес', 'саня', 'сапфир', 'саркис', 'сары', 'сатурн', 'саунд', 'сашка', 'сашок', 'светлый', 'свой', 'святослав', 'себастьян', 'себе', 'севан', 'север', 'северин', 'северо', 'сегундо', 'сеймур', 'сема', 'семен', 'семён', 'сеня', 'сер', 'серафим', 'сервер', 'сергей', 'сергий', 'сережа', 'серж', 'сержан', 'сержант', 'серий', 'серый', 'серёга', 'серёжа', 'сет', 'сиб', 'сивак', 'сидар', 'сидор', 'сила', 'сим', 'симон', 'сино', 'скотт', 'славик', 'славян', 'смех', 'смит', 'совет', 'соловей', 'солт', 'соль', 'сомерсет', 'сомони', 'сон', 'сослан', 'спартак', 'спас', 'сталин', 'стан', 'станислав', 'стас', 'стаффорд', 'степа', 'степан', 'стерлинг', 'стефан', 'сток', 'стоун', 'стоян', 'строй', 'стэнфорд', 'стюарт', 'стёпа', 'суббота', 'сулейман', 'султан', 'сур', 'сурен', 'сухой', 'сухроб', 'сымбат', 'сява', 'сёма', 'тагир', 'тади', 'таиф', 'тайлер', 'так', 'талант', 'талгат', 'таллин', 'там', 'тамерлан', 'таран', 'тарас', 'тау', 'тахир', 'ташир', 'тейлор', 'тел', 'тельман', 'тем', 'тема', 'темир', 'темирлан', 'темка', 'темп', 'темур', 'тен', 'теннесси', 'тер', 'терек', 'техас', 'тигр', 'тигран', 'тилек', 'тим', 'тима', 'тимофей', 'тимур', 'тип', 'титан', 'тихон', 'того', 'токмак', 'толеген', 'толедо', 'толик', 'толян', 'том', 'томас', 'томс', 'торонто', 'тот', 'трент', 'третьяк', 'трой', 'трофим', 'троян', 'туган', 'тула', 'тулун', 'тур', 'тура', 'турал', 'турар', 'туры', 'тут', 'тёма', 'уайт', 'узун', 'уинстон', 'улан', 'улугбек', 'умар', 'умед', 'умет', 'умид', 'умит', 'уолтон', 'уорнер', 'уоррен', 'уорт', 'урал', 'ури', 'урус', 'усик', 'уту', 'ушак', 'уэй', 'уэйк', 'уэйн', 'уэллс', 'уэст', 'уэсти', 'уэстон', 'фаллон', 'фалькон', 'фан', 'фаниль', 'фанис', 'фар', 'фарго', 'фарид', 'фарит', 'фаррух', 'фарух', 'фархад', 'фархат', 'фарход', 'федор', 'федя', 'феликс', 'феникс', 'фернандо', 'фиджи', 'фил', 'филд', 'филин', 'филип', 'филипп', 'филолог', 'фин', 'фируз', 'флинт', 'фор', 'форест', 'франк', 'франклин', 'франко', 'франс', 'франц', 'франциско', 'фредерик', 'фриско', 'фронт', 'фрунзе', 'фур', 'фуркат', 'фёдор', 'хабиб', 'хади', 'хай', 'халид', 'хамза', 'хамид', 'хаммонд', 'хан', 'харрисон', 'хасан', 'хенри', 'хер', 'хилл', 'хилтон', 'хобарт', 'холл', 'холм', 'хома', 'хор', 'хосе', 'хот', 'хотя', 'худ', 'хуй', 'хуршед', 'хусейн', 'царь', 'цезарь', 'цион', 'чабан', 'чад', 'чадыр', 'чак', 'чан', 'чао', 'чарльз', 'черкас', 'черныш', 'черняк', 'честер', 'чех', 'чико', 'чили', 'чингиз', 'чингис', 'чынгыз', 'шавкат', 'шамиль', 'шанс', 'шариф', 'шах', 'шахан', 'шейх', 'шерали', 'шеремет', 'шерзод', 'шерман', 'шестак', 'шин', 'ширак', 'ширван', 'шмидт', 'шнайдер', 'шолом', 'шоу', 'шохрух', 'шульга', 'шумахер', 'шурик', 'шынгыс', 'эверетт', 'эдвард', 'эдгар', 'эдельвейс', 'эдем', 'эдик', 'эдисон', 'эдмонд', 'эдмундс', 'эдуард', 'элгин', 'эльбрус', 'эльвин', 'эльдар', 'эльмир', 'эльнур', 'эльчин', 'эмиль', 'эмин', 'эмир', 'энвер', 'энгельс', 'эрик', 'эркин', 'эрнест', 'эссекс', 'юго', 'юджин', 'юкон', 'юлиан', 'юлий', 'юма', 'юнус', 'юра', 'юрий', 'юрик', 'юрин', 'юрист', 'юрт', 'юсуп', 'юсуф', 'яван', 'ягма', 'яков', 'якуб', 'янис', 'ярослав', 'яша'}

        female_names = {'каролина', 'наталья', 'светлана', 'анастасия', 'анна', 'галина', 'екатерина', 'людмила', 'марина', 'мария', 'оксана', 'юлия', 'ява', 'рико', 'алена', 'алёна', 'валентина', 'надежда', 'саша', 'алания', 'дима', 'ирландия', 'рио', 'рома', 'самара', 'сидней', 'хьюстон', 'никита', 'александра', 'евгения', 'кристина', 'индиана', 'алина', 'настя', 'дели', 'канзас', 'любовь', 'альберта', 'санта', 'лариса', 'катя', 'дания', 'дарья', 'наташа', 'ксения', 'наталия', 'университета', 'оля', 'алма', 'эмилия', 'рейн', 'аня', 'юля', 'вера', 'нина', 'яна', 'ивано', 'кентукки', 'женя', 'невада', 'таня', 'инна', 'кения', 'юта', 'валерия', 'олеся', 'диана', 'атланта', 'алла', 'ленина', 'саха', 'маша', 'даша', 'бостон', 'полина', 'чита', 'лилия', 'валенсия', 'карина', 'вероника', 'света', 'миша', 'карелия', 'тамара', 'азия', 'вика', 'маргарита', 'гана', 'катерина', 'лена', 'европа', 'эль', 'елизавета', 'лима', 'филадельфия', 'жанна', 'лидия', 'лиза', 'александрия', 'кострома', 'сербия', 'ксюша', 'белая', 'анюта', 'слава', 'шри', 'ангелина', 'рика', 'паша', 'алиса', 'дакота', 'рига', 'лера', 'ниу', 'севилья', 'альбина', 'ланка', 'софия', 'ира', 'бали', 'химико', 'петра', 'эльвира', 'анжелика', 'катарина', 'кали', 'мир', 'сицилия', 'натали', 'арина', 'ким', 'надя', 'бай', 'маи', 'мар', 'аделаида', 'ран', 'анжела', 'антонина', 'тринидад', 'монтана', 'катюша', 'кызыл', 'роза', 'женева', 'ника', 'зоя', 'кузьмина', 'люба', 'дела', 'раиса', 'девон', 'ульяна', 'адана', 'кира', 'лида', 'соня', 'софья', 'аленка', 'алёнка', 'дина', 'бруклин', 'рона', 'хуан', 'айгуль', 'динара', 'леся', 'регина', 'люда', 'гульнара', 'ивана', 'галя', 'герцена', 'мадина', 'труда', 'сьерра', 'кале', 'тобаго', 'валя', 'настёна', 'венеция', 'настена', 'алия', 'ильина', 'рита', 'эльмира', 'алеся', 'ярослава', 'катюшка', 'мерида', 'ева', 'виолетта', 'марта', 'бар', 'кас', 'лара', 'влада', 'лори', 'зинаида', 'ида', 'лиля', 'снежана', 'феодосия', 'даня', 'римма', 'мади', 'милана', 'мира', 'элина', 'мид', 'оленька', 'майя', 'мила', 'кара', 'ася', 'бреда', 'кут', 'спринг', 'шаркия', 'айгерим', 'албания', 'даля', 'зарина', 'инга', 'барбара', 'рота', 'вила', 'ангел', 'мами', 'дарина', 'бихар', 'венера', 'лина', 'ами', 'анечка', 'бат', 'олечка', 'светик', 'амина', 'астурия', 'верона', 'василиса', 'альфия', 'илона', 'маришка', 'саванна', 'лис', 'танка', 'айнур', 'лиана', 'артема', 'гузель', 'алевтина', 'элизабет', 'ван', 'варвара', 'наталя', 'нелли', 'гуля', 'фото', 'белен', 'вена', 'сабах', 'асель', 'рай', 'энн', 'дана', 'марианна', 'сабина', 'беверли', 'лагуна', 'меса', 'росарио', 'аврора', 'аида', 'пальма', 'ривер', 'шуя', 'алмаз', 'алсу', 'милена', 'витория', 'мэдисон', 'инта', 'клауд', 'анализа', 'армия', 'джулия', 'сонора', 'хайфа', 'ливия', 'флоренция', 'хана', 'юлька', 'гульназ', 'клара', 'кристи', 'лейла', 'савина', 'вита', 'эля', 'дашка', 'лана', 'олька', 'смела', 'айдана', 'камила', 'моника', 'канта', 'аля', 'ларина', 'настенька', 'поляна', 'сил', 'тюбе', 'долина', 'мари', 'таисия', 'маркса', 'юленька', 'инесса', 'руслана', 'мирослава', 'самая', 'фатима', 'ната', 'вида', 'лика', 'агна', 'медина', 'союза', 'сурат', 'зульфия', 'луиза', 'толя', 'физа', 'нова', 'оби', 'серик', 'милашка', 'генуя', 'мага', 'ник', 'саф', 'анталия', 'лада', 'маруся', 'олена', 'викуся', 'саки', 'сафа', 'айжан', 'неля', 'элла', 'мун', 'альфа', 'иринка', 'алиночка', 'кашмир', 'ярик', 'гульмира', 'маринка', 'юлиана', 'ага', 'дашуля', 'зима', 'алеша', 'индира', 'марьяна', 'миранда', 'доха', 'лаура', 'мая', 'эвелина', 'элеонора', 'валли', 'родина', 'камилла', 'лия', 'кашира', 'айнура', 'мариетта', 'салтанат', 'эри', 'васильевна', 'левина', 'эльза', 'береза', 'лерочка', 'лукина', 'луси', 'наташка', 'горка', 'марго', 'христина', 'азиз', 'викуля', 'аделина', 'ляля', 'магдалена', 'фарида', 'берёза', 'жанар', 'кызы', 'угга', 'юлечка', 'аша', 'злата', 'карен', 'клавдия', 'маре', 'сафина', 'тара', 'файф', 'шева', 'владислава', 'галия', 'славута', 'лёнка', 'марг', 'мистик', 'тома', 'янки', 'альона', 'асем', 'зорина', 'малика', 'рая', 'эмма', 'брук', 'мася', 'диляра', 'кармен', 'леля', 'сауле', 'гармония', 'даун', 'заря', 'ириша', 'куаныш', 'кыз', 'мариша', 'сашенька', 'тан', 'уинтер', 'гайана', 'фаина', 'франка', 'янина', 'аружан', 'катенька', 'катюха', 'кэти', 'мин', 'оро', 'варя', 'гулистан', 'рано', 'рената', 'тайга', 'тоня', 'лёля', 'силвер', 'сорока', 'алтынай', 'зина', 'настасья', 'амарилло', 'аягоз', 'гиз', 'клэр', 'майна', 'нюта', 'рати', 'солнце', 'туран', 'анфиса', 'гаухар', 'лейсан', 'звезда', 'амс', 'кама', 'корона', 'малин', 'руссо', 'акмарал', 'белла', 'евразия', 'карла', 'любов', 'люся', 'мета', 'мэри', 'наиля', 'рада', 'аман', 'жан', 'зарафшан', 'кит', 'нур', 'сальта', 'экс', 'анара', 'аян', 'василина', 'жулдыз', 'залина', 'зухра', 'катрин', 'корал', 'линда', 'лола', 'наргиза', 'тату', 'эльвина', 'вал', 'куль', 'поля', 'ада', 'дельта', 'диля', 'жансая', 'аруба', 'лозанна', 'мали', 'меруерт', 'рубан', 'три', 'труа', 'шухрат', 'альмира', 'асия', 'виталина', 'дария', 'зарема', 'она', 'антигуа', 'зея', 'кам', 'кармел', 'мега', 'новак', 'агата', 'адель', 'никосия', 'нюша', 'олександра', 'онега', 'палестина', 'сара', 'ски', 'стелла', 'тина', 'андорра', 'арайлым', 'барри', 'латина', 'маржан', 'руза', 'сага', 'синай', 'столица', 'тиква', 'ана', 'бланка', 'богдана', 'саида', 'ува', 'янка', 'алмас', 'зая', 'киса', 'настюха', 'азиза', 'аленушка', 'горина', 'гульшат', 'жазира', 'лора', 'малина', 'марьям', 'нургуль', 'папа', 'самира', 'алёнушка', 'лебедь', 'либерия', 'луна', 'лунд', 'роки', 'светочка', 'сиена', 'хелена', 'аделя', 'анита', 'гульнур', 'джамиля', 'евдокия', 'назерке', 'назира', 'олда', 'раушан', 'баян', 'вентура', 'жадыра', 'крис', 'меридиан', 'нан', 'наташенька', 'наша', 'принцесса', 'айка', 'айсулу', 'зиле', 'зоряна', 'ильмира', 'искра', 'карлыгаш', 'линн', 'лолита', 'ляйсан', 'резеда', 'рина', 'сантана', 'тамила', 'уляна', 'юлианна', 'абилин', 'иса', 'лерка', 'лёшка', 'натусик', 'рени', 'руся', 'шолпан', 'акерке', 'алекса', 'лига', 'ляззат', 'мансура', 'нурия', 'рамиля', 'розалия', 'сания', 'сусанна', 'арай', 'бургундия', 'вахдат', 'дерри', 'жанара', 'максима', 'светка', 'стася', 'таш', 'торранс', 'чолпон', 'адиль', 'айша', 'ани', 'аяулым', 'замира', 'зиля', 'иванна', 'ираида', 'лии', 'николь', 'олимпия', 'самарина', 'тая', 'эдуарда', 'америка', 'валюша', 'волга', 'гера', 'ома', 'санди', 'саншайн', 'сева', 'чика', 'асет', 'весна', 'доминика', 'люсия', 'надия', 'назгуль', 'натуся', 'нино', 'нонна', 'победа', 'руфина', 'элита', 'андре', 'ариша', 'барра', 'вега', 'гульжан', 'зозуля', 'каледония', 'кат', 'катька', 'кристал', 'лиса', 'малинка', 'пат', 'совета', 'эко', 'азалия', 'амалия', 'воля', 'даяна', 'жана', 'земфира', 'изабелла', 'калина', 'кристя', 'лилиана', 'люция', 'селена', 'эрика', 'абха', 'айман', 'барда', 'бека', 'белка', 'валюшка', 'истон', 'катеринка', 'катюня', 'килия', 'либерти', 'лорел', 'лоуэлл', 'май', 'майли', 'марион', 'морган', 'нема', 'сама', 'самал', 'серена', 'юрмала', 'айна', 'акбота', 'ардак', 'виталия', 'зуля', 'карелина', 'мина', 'нелля', 'перизат', 'раз', 'разина', 'рима', 'свобода', 'татьянка', 'уна', 'христя', 'элиза', 'абеба', 'алтын', 'братислава', 'иден', 'карсон', 'лёлик', 'олёна', 'радость', 'филина', 'чай', 'августа', 'алта', 'афта', 'владлена', 'галинка', 'гульнар', 'данилина', 'красавица', 'кимберли', 'куралай', 'макпал', 'маня', 'мика', 'рева', 'снежанна', 'сюзанна', 'фея', 'хава', 'хюри', 'эврика', 'элис', 'агни', 'айсылу', 'бота', 'дашуня', 'дети', 'джо', 'ирка', 'канди', 'кирилла', 'маг', 'мерседес', 'миляуша', 'назым', 'саар', 'сату', 'чик', 'шарм', 'шынар', 'айзада', 'айнагуль', 'анель', 'апреля', 'виола', 'гульфия', 'гурия', 'деня', 'заира', 'ксеня', 'майра', 'муи', 'нинель', 'олинда', 'пальмира', 'роксана', 'рузанна', 'сабрина', 'саят', 'серафима', 'сима', 'фариза', 'хива', 'элена', 'юрина', 'айым', 'асема', 'бабина', 'байрам', 'голден', 'дай', 'киба', 'лэнгли', 'люкс', 'мао', 'перл', 'сили', 'сими', 'унн', 'черри', 'шони', 'авиа', 'алмагуль', 'галерея', 'дали', 'дамира', 'дильназ', 'жасмин', 'зара', 'ива', 'констанца', 'лизка', 'лили', 'лоран', 'мальвина', 'марал', 'нана', 'нара', 'оленка', 'рамзия', 'сана', 'сандра', 'станислава', 'талька', 'таша', 'уля', 'феруза', 'фируза', 'флора', 'айгул', 'аяжан', 'базар', 'веселая', 'ворона', 'гренада', 'даниэль', 'дума', 'ирек', 'керри', 'кымбат', 'кэт', 'махаббат', 'мен', 'мери', 'миллс', 'мини', 'оки', 'помона', 'сакура', 'сандугаш', 'селина', 'тайна', 'тата', 'точка', 'унна', 'урбана', 'хазар', 'хит', 'целина', 'челси', 'шира', 'шура', 'аза', 'аксана', 'аннушка', 'аяна', 'балжан', 'бибигуль', 'ботагоз', 'гулия', 'добринка', 'жибек', 'ита', 'лира', 'марья', 'мерей', 'роксолана', 'эллина', 'амелина', 'бери', 'вейл', 'велика', 'вода', 'гали', 'ганжа', 'добрая', 'ерик', 'зона', 'каллен', 'кристалл', 'нами', 'нола', 'омега', 'пис', 'сат', 'сая', 'сталь', 'тони', 'тоша', 'флоренс', 'ширин', 'аиша', 'амелия', 'аниса', 'арика', 'аэлита', 'баба', 'гаврилина', 'ганина', 'гаяне', 'глория', 'забелина', 'ирма', 'камшат', 'кларита', 'лилит', 'мишель', 'наргиз', 'наталка', 'пелагея', 'радмила', 'райхан', 'романа', 'русина', 'сабира', 'саян', 'софи', 'флюра', 'эльнара', 'ярина', 'абда', 'авиация', 'ади', 'алба', 'альтаграсия', 'вики', 'винкс', 'виолета', 'геля', 'гулнур', 'ирэн', 'кун', 'маб', 'марлен', 'нико', 'пилар', 'пони', 'райн', 'рифат', 'салина', 'сезон', 'тася', 'той', 'фемида', 'фонда', 'фортуна', 'хас', 'шар', 'шахноза', 'шер', 'юли', 'юри', 'айзат', 'анаит', 'анеля', 'аркадия', 'асыл', 'бэлла', 'валентинка', 'веста', 'ветка', 'ганна', 'гульдана', 'гульсина', 'джульетта', 'есения', 'индустрия', 'казимира', 'катрина', 'качар', 'клава', 'конкордия', 'кэтрин', 'ландыш', 'мариам', 'мариана', 'марика', 'марин', 'марфа', 'миля', 'наира', 'нора', 'патимат', 'патя', 'саламат', 'софа', 'танзиля', 'тахмина', 'улжан', 'улыбка', 'ума', 'фрося', 'ясмина', 'ажар', 'айпери', 'аки', 'армине', 'асемгуль', 'ашан', 'белл', 'буга', 'вади', 'волна', 'гузалия', 'гулим', 'гулназ', 'дин', 'доля', 'доно', 'жанерке', 'жена', 'камал', 'камерон', 'карми', 'карол', 'коди', 'люси', 'мала', 'мер', 'мээрим', 'наука', 'нера', 'нурай', 'партия', 'толкын', 'уит', 'чара', 'чулпан', 'юрика', 'агния', 'айгуля', 'айнаш', 'айшат', 'алима', 'алуа', 'антонида', 'ариадна', 'ариана', 'ванина', 'вераника', 'вета', 'владимира', 'гала', 'гвиана', 'дилара', 'дора', 'емелина', 'жамиля', 'ирена', 'лизавета', 'лусине', 'любава', 'мара', 'муся', 'наида', 'петролина', 'прасковья', 'райхана', 'рузиля', 'румия', 'салима', 'самария', 'сластёна', 'стефания', 'фания', 'элен', 'эра', 'яся', 'аква', 'ара', 'бима', 'валек', 'грей', 'гулдана', 'гулжан', 'гута', 'добра', 'зоря', 'изо', 'ильхам', 'ируся', 'карни', 'катина', 'келлер', 'коламбия', 'комфорт', 'кри', 'кул', 'лента', 'линден', 'маргоша', 'милютина', 'мэги', 'натка', 'нева', 'ниночка', 'нургул', 'роса', 'сами', 'санина', 'севера', 'селин', 'сергея', 'сурин', 'сурина', 'тори', 'чантилли', 'элит', 'элька', 'адина', 'айя', 'аксинья', 'алана', 'алефтина', 'алика', 'альвина', 'альфира', 'аминат', 'амира', 'андрея', 'андриана', 'анжелла', 'ануш', 'арена', 'арзу', 'ариэль', 'арма', 'ару', 'астра', 'аурика', 'афина', 'василя', 'вилена', 'володарка', 'гая', 'гюзель', 'дарига', 'елина', 'жанель', 'жания', 'изольда', 'илга', 'илюза', 'ирен', 'катена', 'килина', 'константина', 'лала', 'линара', 'липа', 'ляна', 'маврина', 'мариям', 'мартина', 'муза', 'нарине', 'насиба', 'натуська', 'нафиса', 'нигина', 'нигора', 'нона', 'осина', 'павла', 'разиля', 'раиля', 'расима', 'раушания', 'рашида', 'резида', 'седа', 'соломина', 'таиса', 'тевриз', 'тогжан', 'томирис', 'туяна', 'халида', 'хая', 'эмили', 'юнона', 'айжамал', 'акрам', 'ала', 'алишка', 'бану', 'блум', 'бонита', 'брайс', 'буэна', 'валёк', 'верея', 'вин', 'вьенна', 'гайя', 'галка', 'гамма', 'греш', 'гули', 'джан', 'джуно', 'дуа', 'дэйли', 'ерке', 'жаным', 'жур', 'жылдыз', 'иман', 'йена', 'кала', 'камран', 'каш', 'лав', 'лаззат', 'лайт', 'масяня', 'мах', 'мунира', 'навруз', 'наз', 'ники', 'николя', 'нуржамал', 'нурсулу', 'пейдж', 'пен', 'пола', 'прима', 'рошель', 'рука', 'санечка', 'сонома', 'суда', 'тамала', 'товуз', 'умма', 'фидан', 'хайд', 'хермоса', 'холли', 'чун', 'шаки', 'шамина', 'шат', 'шелби', 'юлек', 'августина', 'агнесса', 'адиля', 'адриана', 'айганым', 'айза', 'айко', 'айслу', 'акмаль', 'александрина', 'анджела', 'анжелина', 'апрель', 'асият', 'асмик', 'багира', 'бурул', 'валери', 'ванда', 'гаянэ', 'глафира', 'гоар', 'грейс', 'гузаль', 'цветок', 'гульнура', 'гульсара', 'даниела', 'дарима', 'даурия', 'дмитрия', 'домна', 'дуся', 'екатирина', 'енина', 'зульфира', 'иванка', 'ильнара', 'иоанна', 'ирада', 'калерия', 'карине', 'кирилина', 'клеопатра', 'красина', 'ксенья', 'ленара', 'мавритания', 'михайлина', 'мия', 'мора', 'нагима', 'надира', 'натания', 'нэля', 'прасковея', 'ралина', 'рамина', 'рината', 'рузана', 'рушана', 'святослава', 'севара', 'сильвия', 'сия', 'скай', 'тереза', 'тереса', 'туся', 'умида', 'хадижа', 'ханна', 'хеда', 'хельга', 'эльзара', 'азад', 'аит', 'акша', 'альбинка', 'африка', 'балнур', 'балык', 'бани', 'бегимай', 'бела', 'валечка', 'варва', 'гарина', 'гуд', 'гуль', 'гульсум', 'дашутка', 'диване', 'ерина'}
        
        name = name.lower().strip().replace('ё', 'е')
        
        if name in male_names:
            return 1
        if name in female_names:
            return 0
        return 2

    def is_rus(text):
        try:
            if text is None or text == '':
                return False
            text = text.lower()
            cyrillic_alphabet = ['а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я']
            for char in cyrillic_alphabet:
                if char in text:
                    return True
            return False
        except Exception:
            return False

    try:
        if name is None or name == '':
            return 'U'
        
        name = str(name)
        name = name.lower()
        
        bad_chars = [
            ' ', '\t', '*', '-', '+', '=', '*', '&', '?', '%', ':', ';', '"', '^', '$', '#', '№', '@', '!', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '~', '`', '_', '|',
            '😊', '👍', '😀', '☺', '🤓', '😁', '👌', '🧐', '🙈', '😌', '😉', '👇', '👉', '😃', '😀', '😃', '😄', '😅', '🙃', '🙂', '☺', '️😊', '😎', '😏', '🤔', '🤭', '👐', '🤝', '👍', '🤟', '✌', '️👌', '✋', '🖐', '🙏', '🐰', '🐹', '🐭', '🐱', '🐯', '🦁', '🐮', '🐷', '🙈', '🐵', '🙊', '🐶', '☀', '️🌤', '☂', '️🚗', '🚕', '🚙', '📞', '☎', '️✡', '️💟', '❤', '️✅', '🕐', '🕑', '💲', '🚬'
        ]
        
        for char in bad_chars:
            name = name.replace(char, '')
            
        if name is None or name == '':
            return 'U'
            
        if is_rus(name):
            if len(name) >= 2 and name[-2] == 'а' and name[-1] == 'я':
                return 'F'
            
            rus_gender = get_gender_rus(name)
            if rus_gender == 1:
                return 'M'
            if rus_gender == 0:
                return 'F'
                
        if name[-1] == 'a' or name[-1] == 'а':
            return 'F'
            
        pred = predict(name)
        if 'Boy' in pred:
            return 'M'
        if 'Girl' in pred:
            return 'F'
            
        return 'U'
    except Exception:
        return 'U'